#### Rectangle Members

---

|  |
| --- |
| Rectangle Class   Constructors   Methods   Properties   See Also |

The  Rectangle  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | Rectangle | Create an empty Rectangle instance with values (0,0,0,0). |
| Public method | Rectangle(Rectangle) | Constructs a new copy of the input ScreenRectangle object. |
| Public method | Rectangle(Int32, Int32, Int32, Int32) | Creates an Rectangle instance with the specified four integers that represent the left, top, right and bottom of a rectangle. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  Rectangle |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | IsNormalized | Returns true if the rectangle coordinates are normalized to the screen coordinate space; that is, left is less than right and top is less than bottom. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Bottom | The y-coordinate of the bottom-right corner of the rectangle. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | Left | The x-coordinate of the top-left corner of the rectangle. |
| Public property | Right | The x-coordinate of the bottom-right corner of the rectangle. |
| Public property | Top | The y-coordinate of the top-left corner of the rectangle. |

# See Also

Rectangle Class

Autodesk.Revit.DB Namespace